; domain
(define (domain rescue-drone)

    (:requirements :strips :negative-preconditions)

    (:predicates
        (position ?P) ; P is a valid coordinate position (assuming square grid)
        (inc ?P ?PP) ; PP is greater coordinate than P
        (safe-zone ?X ?Y) ; The safe zone is at coordinates (X, Y)
        (obstacle ?X ?Y) ; There is an obstacle at coordinates (X, Y)
        (person-location ?X ?Y) ; There is a person at coordinates (X, Y)
        (drone-location ?X ?Y) ; The drone is at coordinates (X, Y)
        (empty-drone) ; The drone is not carrying a person
        (spot ?S) ; S is a valid spot of the safe zone
        (free-spot ?S) ; The spot S of the safe zone is free
    )

    (:action up
        :parameters (?X ?Y ?NY)

        :precondition (and
            (position ?X) (position ?Y) (position ?NY)
            (inc ?NY ?Y)
            (drone-location ?X ?Y)
            (not (obstacle ?X ?NY))
        )

        :effect (and
            (drone-location ?X ?NY)
            (not (drone-location ?X ?Y))
        )
    )

    (:action down
        :parameters (?X ?Y ?NY)

        :precondition (and
            (position ?X) (position ?Y) (position ?NY)
            (inc ?Y ?NY)
            (drone-location ?X ?Y)
            (not (obstacle ?X ?NY))
        )

        :effect (and
            (drone-location ?X ?NY)
            (not (drone-location ?X ?Y))
        )
    )

    (:action right
        :parameters (?X ?Y ?NX)

        :precondition (and
            (position ?X) (position ?Y) (position ?NX)
            (inc ?X ?NX)
            (drone-location ?X ?Y)
            (not (obstacle ?NX ?Y))
        )

        :effect (and
            (drone-location ?NX ?Y)
            (not (drone-location ?X ?Y))
        )
    )

    (:action left
        :parameters (?X ?Y ?NX)

        :precondition (and
            (position ?X) (position ?Y) (position ?NX)
            (inc ?NX ?X)
            (drone-location ?X ?Y)
            (not (obstacle ?NX ?Y))
        )

        :effect (and
            (drone-location ?NX ?Y)
            (not (drone-location ?X ?Y))
        )
    )

    (:action pick-up
        :parameters (?X ?Y)

        :precondition (and
            (position ?X) (position ?Y)
            (drone-location ?X ?Y)
            (person-location ?X ?Y)
            (empty-drone)
        )

        :effect (and
            (not (person-location ?X ?Y))
            (not (empty-drone))
        )
    )

    (:action drop-off
        :parameters (?X ?Y ?S)

        :precondition (and
            (position ?X) (position ?Y)
            (drone-location ?X ?Y)
            (not (empty-drone))
            (safe-zone ?X ?Y)
            (spot ?S) (free-spot ?S)
        )

        :effect (and
            (empty-drone)
            (person-location ?X ?Y)
            (not (free-spot ?S))
        )
    )

    (:action evacuate-safe-zone
        :parameters (?S)

        :precondition (and
            (spot ?S)
            (not (free-spot ?S))
        )

        :effect (free-spot ?S)
    )

)

; problem
(define (problem pb1)

    (:domain rescue-drone)

    (:objects
        P1 P2 P3 P4 S1 S2 S3
    )

    (:init
        (position P1)
        (position P2)
        (position P3)
        (position P4)

        (inc P1 P2)
        (inc P2 P3)
        (inc P3 P4)

        (safe-zone P2 P4)

        (spot S1)
        (spot S2)
        (spot S3)

        (free-spot S1)
        (free-spot S2)
        (free-spot S3)

        (person-location P4 P1)
        (person-location P1 P2)
        (person-location P2 P3)

        (drone-location P1 P1)
        (empty-drone)
    )

    (:goal
        (and
            (not (person-location P4 P1))
            (not (person-location P1 P2))
            (not (person-location P2 P3))
            (person-location P2 P4)
            (empty-drone))
    )
)

; plan
1. (down p1 p1 p2)
   deleted: (drone-location p1 p1)
   added: (drone-location p1 p2)
   goals met: 1 of 5
2. (pick-up p1 p2)
   deleted: (person-location p1 p2) (empty-drone)
   goals met: 1 of 5
3. (right p1 p2 p2)
   deleted: (drone-location p1 p2)
   added: (drone-location p2 p2)
   goals met: 1 of 5
4. (down p2 p2 p3)
   deleted: (drone-location p2 p2)
   added: (drone-location p2 p3)
   goals met: 1 of 5
5. (down p2 p3 p4)
   deleted: (drone-location p2 p3)
   added: (drone-location p2 p4)
   goals met: 1 of 5
6. (drop-off p2 p4 s2)
   deleted: (free-spot s2)
   added: (empty-drone) (person-location p2 p4)
   goals met: 3 of 5
7. (up p2 p4 p3)
   deleted: (drone-location p2 p4)
   added: (drone-location p2 p3)
   goals met: 3 of 5
8. (pick-up p2 p3)
   deleted: (person-location p2 p3) (empty-drone)
   goals met: 3 of 5
9. (down p2 p3 p4)
   deleted: (drone-location p2 p3)
   added: (drone-location p2 p4)
   goals met: 3 of 5
10. (drop-off p2 p4 s3)
   deleted: (free-spot s3)
   added: (empty-drone)
   goals met: 4 of 5
11. (right p2 p4 p3)
   deleted: (drone-location p2 p4)
   added: (drone-location p3 p4)
   goals met: 4 of 5
12. (right p3 p4 p4)
   deleted: (drone-location p3 p4)
   added: (drone-location p4 p4)
   goals met: 4 of 5
13. (up p4 p4 p3)
   deleted: (drone-location p4 p4)
   added: (drone-location p4 p3)
   goals met: 4 of 5
14. (up p4 p3 p2)
   deleted: (drone-location p4 p3)
   added: (drone-location p4 p2)
   goals met: 4 of 5
15. (up p4 p2 p1)
   deleted: (drone-location p4 p2)
   added: (drone-location p4 p1)
   goals met: 4 of 5
16. (pick-up p4 p1)
   deleted: (person-location p4 p1) (empty-drone)
   goals met: 4 of 5
17. (left p4 p1 p3)
   deleted: (drone-location p4 p1)
   added: (drone-location p3 p1)
   goals met: 4 of 5
18. (left p3 p1 p2)
   deleted: (drone-location p3 p1)
   added: (drone-location p2 p1)
   goals met: 4 of 5
19. (down p2 p1 p2)
   deleted: (drone-location p2 p1)
   added: (drone-location p2 p2)
   goals met: 4 of 5
20. (down p2 p2 p3)
   deleted: (drone-location p2 p2)
   added: (drone-location p2 p3)
   goals met: 4 of 5
21. (down p2 p3 p4)
   deleted: (drone-location p2 p3)
   added: (drone-location p2 p4)
   goals met: 4 of 5
22. (drop-off p2 p4 s1)
   deleted: (free-spot s1)
   added: (empty-drone)
   goals met: 5 of 5
